Revit 2027 API
SunAndShadowSettings.Visible Property
 Visibility in current view for a per-view SunAndShadowSettings element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Visible { get; set; }
Public Property Visible As Boolean
	Get
	Set
public:
property bool Visible {
	bool get ();
	void set (bool value);
}
member Visible : bool with get, set
Property Value
Boolean
 Visibility
Exceptions
Exception | Condition
ArgumentException |  The element is not view specific (in which case visibility is not relevant) or if internally its view is not accessible.
See Also
Reference
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace